package com.dpad.telematicsclientapp.util;

/**
 * ================================================
 * 作    者：booob
 * 版    本：1.0
 * 描    述：
 * ================================================
 */
public enum TitleToCode {


    /**
     * 埋点数据
     */
//    TYPE1("车辆定位", 1001),//已加
    TYPE2("账号登录页面", "app_p_00101"),//已加
    TYPE3("消息中心", "app_p_07200"),//已加
    TYPE4("车况报告-首页", "app_p_02600"),//已加
//    TYPE5("违章查询", 1005),
//
//    TYPE7("车辆信息", 1007),
//    TYPE8("流量查询", 1008),//已加
//    TYPE9("天气", 1009),
//    TYPE10("保险信息", 1010),

    //    TYPE11("新闻", 1011),
    TYPE12("地图-导航到车", "app_f_06800"),
    TYPE13("下发POI", "app_f_07000"),
//    TYPE14("一键呼叫", 1014),
//    TYPE15("在线电台/音乐", 1015),

//    TYPE16("功能介绍", 1016),
//    TYPE17("收件箱", 1017),
//    TYPE18("用车指南", 1018),
//    TYPE19("离线导航", 1019),
//    TYPE20("二维码呈现", 1020),

    //    TYPE21("用户信息", 1021),
//    TYPE22("维修保养预约", 1022),
    TYPE23("关于我们", "app_p_08602"),
    TYPE24("修改密码页面", "app_p_09901"),//已加
    //    TYPE25("关于CITROEN CONNECT", 1025),//
    //
    TYPE26("离车导航（最后一公里导航）", "1026"),//
    TYPE27("环保驾驶-首页", "app_p_02300"),//已加
    TYPE28("爱车追踪-地图", "app_p_05800"),//已加
    TYPE29("个人中心-自助激活", "app_p_08604"),//已加
//        TYPE30("订单查询", 1030),//
    //
//    TYPE31("商品列表", 1031),//
//    TYPE32("商品详情", 1032),//
    TYPE33("设置", "app_p_08601"),//已加
//    TYPE34("网点查询", 1034),//
//    TYPE35("语音识别", 1035),//

    TYPE36("首页", "app_p_10402"),//已加
    //    TYPE37("行驶记录", 1037),
//    TYPE38("开具发票", 1038),
    TYPE39("个人中心-车载wifi", "app_p_08609"),//已加

    //    TYPE42("电子围栏", 1040),//
    TYPE54("缓存清理", "app_f_10200"),//已加
    TYPE55("版本更新", "app_f_10100"),//已加
    TYPE57("备件查询-首页", "app_p_04600"),//已加
    //    TYPE58("维修进度查询", 1044),//
//    TYPE52("消息设置", 1045),//
//    TYPE44("个人中心", 1046),//
    TYPE40("紧急救援-首页", "app_p_04200"),//已加
    TYPE41("救援记录查询", "app_p_04500"),//已加
    //    TYPE46("车牌号码", 1049),//替换为修改车牌号
//    TYPE48("保养历史", 1050),//已加
    TYPE51("修改预留手机号页面", "app_p_10001"),//已加
    TYPE60("预约记录查询", "app_p_04100"),//已加
    TYPE61("退出登录", "app_f_10300"),//已加


    /**
     * 新增
     */
    TYPE62("维保预约-首页", "app_f_03400"),//已加
    TYPE63("维保预约-车况报告", "app_f_03700"),//已加
    TYPE64("维保预约—选网点", "app_p_03800"),//已加
    TYPE65("维保预约—填信息", "app_p_03900"),//已加
    TYPE66("维保预约—提交", "app_f_04000"),//已加

    /**
     * 页面统计
     */
    TYPE67("远控功能-首页", "app_p_04900"),//已加
    TYPE68("预约空调页面", "app_p_05001"),//已加
    TYPE69("预约充电页面", "app_p_05002"),//已加
    TYPE70("远控功能-修改PIN码", "app_f_05100"),//已加
    TYPE71("远控功能-修改安全问题", "app_f_05200"),//已加

    TYPE72("行程记录-地图-首页", "app_p_01700"),//已加
    TYPE73("行程记录-列表-首页", "app_p_01900"),//已加
    TYPE74("流量查询-音乐", "app_p_03100"),//已加
    TYPE75("流量查询-广播", "app_p_03200"),//已加
    TYPE76("流量查询-WIFI", "app_p_03300"),//已加
    TYPE77("首页功能自定义页面", "app_p_10401"),//已加
    TYPE78("地图首页", "app_p_06100"),////已加
    TYPE79("地图-搜索", "app_p_06200"),//已加
    TYPE80("经销商查询-地图", "app_p_06400"),//已加
    TYPE81("充电桩查询-地图", "app_f_06600"),//  跳转支付宝，无法统计
    TYPE82("探索发现-寻车", "app_p_06801"),//已加
    TYPE83("地图-我的收藏", "app_p_06900"),//已加
    TYPE84("消息中心-系统消息", "app_p_07800"),//已加
    TYPE85("消息中心-最新活动", "app_p_07300"),//已加
    TYPE86("消息中心-维保预约", "app_p_07400"),//已加
    TYPE87("消息中心-救援服务", "app_p_07500"),//已加
    TYPE88("消息中心-增值服务助手", "app_p_07600"),//已加
    TYPE89("商城首页", "app_p_05300"),//已加
    TYPE90("流量商城", "app_f_05400"),//已加
    TYPE91("备件商城", "app_f_05500"),//已加
    TYPE92("品牌活动", "app_f_05600"),//已加
    TYPE93("个人中心-时间轴", "app_p_08500"),//已加
    TYPE94("个人中心-详细", "app_p_08600"),//已加
    TYPE95("爱车追踪-个人中心", "app_p_05900"),//已加
    TYPE96("设置个人资料", "app_p_09700"),//已加

    TYPE97("维保预约-个人中心", "app_f_03500"),//已加
    TYPE98("紧急救援-个人中心", "app_p_04300"),//已加
    TYPE99("充电桩查询-个人中心", "app_f_06700"),//已加
    TYPE100("经销商查询-个人中心", "app_p_06500"),//已加
    TYPE101("流量查询-个人中心", "app_p_02900"),//已加
    TYPE102("个人中心-车况报告", "app_p_02700"),//已加
    TYPE103("行程记录-地图-个人中心", "app_p_01800"),//已加
    TYPE104("行程记录-列表-个人中心", "app_p_02000"),//已加

    TYPE105("车型推介", "app_p_00400"),
    TYPE106("预约试驾-首页", "app_f_00500"),//功能已加
    TYPE107("我的爱车", "app_p_08800"),//已加
    TYPE108("个人中心-添加爱车", "app_p_08603"),//已加
    TYPE109("个人中心-车牌号码", "app_p_08607"),//已加
    TYPE110("个人中心-爱车昵称", "app_p_08608"),//已加
    TYPE111("保养记录", "app_p_08900"),// 原code有
    TYPE112("个人中心-发票与合同", "app_p_08605"),//已加
    TYPE113("个人中心-实名认证", "app_p_08606"),//已加

    TYPE144("备件查询-个人中心", "app_p_04700"),//已加
    TYPE145("消息中心-远控消息", "app_p_07700"),//已加
    TYPE146("充电记录", "app_p_09000"),//已加
    TYPE147("预约试驾-个人中心", "app_p_00600"),//已加
    TYPE160("远控体验界面", "app_p_00801"),//已加
    TYPE161("远控功能-设置", "app_p_05000"),//已加
    TYPE162("忘记密码", "app_p_09801"),//已加
    TYPE163("环保驾驶-个人中心", "app_p_02400"),//已加

    /**
     * 功能统计
     */
//    TYPE115("探索发现信息获取", 2001),//已加 探索发现
//    TYPE116("经销商查询信息", 2002),//已加
//    TYPE117("充电桩查询信息", 2003),//已加 普通
    TYPE118("地图-安全助手电话拨打", "app_f_07100"),//已加
    //    TYPE119("探索发现查询poi", 2005),//已加
    TYPE120("预约试驾-提交", "app_f_00700"),//已加
    TYPE121("已读-系统消息", "app_f_08400"),//已加
    TYPE122("已读-最新活动", "app_f_07900"),//已加
    TYPE123("已读-维保预约", "app_f_08000"),//已加
    TYPE124("已读-救援服务", "app_f_08100"),//已加
    TYPE125("已读-增值服务助手", "app_f_08200"),//已加
    //缺少远控消息 电子围栏消息
    TYPE126("微信分享", "app_f_10500"),//已加
    TYPE127("QQ分享", "app_f_10600"),//已加
    TYPE128("行程记录-模式切换", "app_f_02100"),//已加
    //    TYPE129("环保驾驶查询", 2015),//已加
//    TYPE130("车况报告查询", 2016),//已加
    TYPE131("流量查询-首页", "app_p_02800"),//已加
    TYPE132("备件扫码", "app_f_04800"),//已加
    TYPE133("活动报名人次", "app_f_05700"),//已加
    TYPE134("首页功能自定义", "app_f_10400"),//已加
    //    TYPE135("救援记录信息获取", 2021),//已加
//    TYPE136("预约记录信息获取", 2022),//已加
//    TYPE137("我的爱车信息获取", 2023),//已加
    TYPE138("添加爱车", "app_f_09100"),//已加
    TYPE139("上传实名照片", "app_f_09200"),//已加
    TYPE140("上传发票合同", "app_f_09300"),//已加//
    TYPE141("忘记密码功能", "app_f_09800"),//已加
    TYPE142("自动登录", "app_f_00300"),//已加
    TYPE143("地图-搜周边", "app_f_06300"),//已加


    TYPE164("账号登录", "app_f_00100"),//已加
    TYPE165("验证码登录", "app_f_00200"),//已加
    TYPE166("流量查询-商城首页", "app_f_03000"),//已加
    TYPE167("爱车追踪-拨打电话", "app_f_06000"),//已加
    TYPE168("已读-远控消息", "app_f_08300"),//已加
    TYPE169("修改密码提交", "app_f_09900"),//已加
    TYPE170("修改预留手机号提交", "app_f_10000"),//已加
    TYPE171("个人中心显示模式切换", "app_f_08700"),//已加
    TYPE172("设置车牌号", "app_f_09400"),//已加
    TYPE173("设置爱车昵称", "app_f_09500"),//已加
    TYPE174("设置车载WIFI", "app_f_09600"),//已加


    TYPE175("行程记录-分享", "app_f_02200"),
    TYPE176("环保驾驶-分享", "app_f_02500"),


    TYPE148("朋友圈分享", "app_f_10700"),
    TYPE149("QQ空间分享", "app_f_10800"),
    TYPE150("远控体验-首页上锁", "app_f_00900"),//已加
    TYPE151("远控体验-首页开启空调", "app_f_01000"),//已加
    TYPE152("远控体验-首页寻车", "app_f_01100"),//已加
    TYPE153("远控体验-首页", "app_f_00800"),//已加
    TYPE154("远控体验-上锁", "app_f_01200"),
    TYPE155("远控体验-解锁", "app_f_01300"),
    TYPE156("远控体验-寻车", "app_f_01400"),
    TYPE157("远控体验-空调开启", "app_f_01500"),
    TYPE158("远控体验-空调关闭", "app_f_01600"),
    TYPE159("紧急救援拨打电话", "app_f_04400"),//已加
    TYPE114("维保预约-经销商查询", "app_f_03600");//已加





    private String title;
    private String code;


    // 构造方法
    TitleToCode(String title, String code) {
        this.title = title;
        this.code = code;
    }

    //覆盖方法
    @Override
    public String toString() {
        return this.code + "_" + this.name();
    }

    public String getTitle() {
        return title;
    }

    public void setTitle(String title) {
        this.title = title;
    }

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }


    /**
     * 根据title获取去code
     *
     * @param title
     * @return
     */
    public static String getCodeByTitle(String title) {
        for (TitleToCode platformFree : TitleToCode.values()) {
            if (title.equals(platformFree.getTitle())) {
                return platformFree.getCode();
            }
        }
        return "-1";
    }

}
